MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F451KETB/mcu.h
/*  Bit definition for DMA_RCFGCTL register  */
#define DMA_RCFGCTL_RCFGEN_POS                         (0U)
#define DMA_RCFGCTL_RCFGEN                             (0x00000001UL)
#define DMA_RCFGCTL_RCFGLLP_POS                        (1U)
#define DMA_RCFGCTL_RCFGLLP                            (0x00000002UL)
#define DMA_RCFGCTL_RCFGCHS_POS                        (8U)
#define DMA_RCFGCTL_RCFGCHS                            (0x00000F00UL)
#define DMA_RCFGCTL_RCFGCHS_0                          (0x00000100UL)
#define DMA_RCFGCTL_RCFGCHS_1                          (0x00000200UL)
#define DMA_RCFGCTL_RCFGCHS_2                          (0x00000400UL)
#define DMA_RCFGCTL_RCFGCHS_3                          (0x00000800UL)
#define DMA_RCFGCTL_SARMD_POS                          (16U)
#define DMA_RCFGCTL_SARMD                              (0x00030000UL)
#define DMA_RCFGCTL_SARMD_0                            (0x00010000UL)
#define DMA_RCFGCTL_SARMD_1                            (0x00020000UL)
#define DMA_RCFGCTL_DARMD_POS                          (18U)
#define DMA_RCFGCTL_DARMD                              (0x000C0000UL)
#define DMA_RCFGCTL_DARMD_0                            (0x00040000UL)
#define DMA_RCFGCTL_DARMD_1                            (0x00080000UL)
#define DMA_RCFGCTL_CNTMD_POS                          (20U)
#define DMA_RCFGCTL_CNTMD                              (0x00300000UL)
#define DMA_RCFGCTL_CNTMD_0                            (0x00100000UL)
#define DMA_RCFGCTL_CNTMD_1                            (0x00200000UL)

/*  Bit definition for DMA_SAR register  */
#define DMA_SAR                                        (0xFFFFFFFFUL)

/*  Bit definition for DMA_DAR register  */
#define DMA_DAR                                        (0xFFFFFFFFUL)

/*  Bit definition for DMA_DTCTL register  */
#define DMA_DTCTL_BLKSIZE_POS                          (0U)
#define DMA_DTCTL_BLKSIZE                              (0x000003FFUL)
#define DMA_DTCTL_CNT_POS                              (16U)
#define DMA_DTCTL_CNT                                  (0xFFFF0000UL)

/*  Bit definition for DMA_RPT register  */
#define DMA_RPT_SRPT_POS                               (0U)
#define DMA_RPT_SRPT                                   (0x000003FFUL)
#define DMA_RPT_DRPT_POS                               (16U)
#define DMA_RPT_DRPT                                   (0x03FF0000UL)

/*  Bit definition for DMA_RPTB register  */
#define DMA_RPTB_SRPTB_POS                             (0U)
#define DMA_RPTB_SRPTB                                 (0x000003FFUL)
#define DMA_RPTB_SRPTB_0                               (0x00000001UL)
#define DMA_RPTB_SRPTB_1                               (0x00000002UL)
#define DMA_RPTB_SRPTB_2                               (0x00000004UL)
#define DMA_RPTB_SRPTB_3                               (0x00000008UL)
#define DMA_RPTB_SRPTB_4                               (0x00000010UL)
#define DMA_RPTB_SRPTB_5                               (0x00000020UL)
#define DMA_RPTB_SRPTB_6                               (0x00000040UL)
#define DMA_RPTB_SRPTB_7                               (0x00000080UL)
#define DMA_RPTB_SRPTB_8                               (0x00000100UL)
#define DMA_RPTB_SRPTB_9                               (0x00000200UL)
#define DMA_RPTB_DRPTB_POS                             (16U)
#define DMA_RPTB_DRPTB                                 (0x03FF0000UL)
#define DMA_RPTB_DRPTB_0                               (0x00010000UL)
#define DMA_RPTB_DRPTB_1                               (0x00020000UL)
#define DMA_RPTB_DRPTB_2                               (0x00040000UL)
#define DMA_RPTB_DRPTB_3                               (0x00080000UL)
#define DMA_RPTB_DRPTB_4                               (0x00100000UL)
#define DMA_RPTB_DRPTB_5                               (0x00200000UL)
#define DMA_RPTB_DRPTB_6                               (0x00400000UL)
#define DMA_RPTB_DRPTB_7                               (0x00800000UL)
#define DMA_RPTB_DRPTB_8                               (0x01000000UL)
#define DMA_RPTB_DRPTB_9                               (0x02000000UL)

/*  Bit definition for DMA_SNSEQCTL register  */
#define DMA_SNSEQCTL_SOFFSET_POS                       (0U)
#define DMA_SNSEQCTL_SOFFSET                           (0x000FFFFFUL)
#define DMA_SNSEQCTL_SNSCNT_POS                        (20U)
#define DMA_SNSEQCTL_SNSCNT                            (0xFFF00000UL)

/*  Bit definition for DMA_SNSEQCTLB register  */
#define DMA_SNSEQCTLB_SNSDIST_POS                      (0U)
#define DMA_SNSEQCTLB_SNSDIST                          (0x000FFFFFUL)
#define DMA_SNSEQCTLB_SNSDIST_0                        (0x00000001UL)
#define DMA_SNSEQCTLB_SNSDIST_1                        (0x00000002UL)
#define DMA_SNSEQCTLB_SNSDIST_2                        (0x00000004UL)
#define DMA_SNSEQCTLB_SNSDIST_3                        (0x00000008UL)
#define DMA_SNSEQCTLB_SNSDIST_4                        (0x00000010UL)
#define DMA_SNSEQCTLB_SNSDIST_5                        (0x00000020UL)
#define DMA_SNSEQCTLB_SNSDIST_6                        (0x00000040UL)
#define DMA_SNSEQCTLB_SNSDIST_7                        (0x00000080UL)
#define DMA_SNSEQCTLB_SNSDIST_8                        (0x00000100UL)
#define DMA_SNSEQCTLB_SNSDIST_9                        (0x00000200UL)
#define DMA_SNSEQCTLB_SNSDIST_10                       (0x00000400UL)
#define DMA_SNSEQCTLB_SNSDIST_11                       (0x00000800UL)
#define DMA_SNSEQCTLB_SNSDIST_12                       (0x00001000UL)
#define DMA_SNSEQCTLB_SNSDIST_13                       (0x00002000UL)
#define DMA_SNSEQCTLB_SNSDIST_14                       (0x00004000UL)
#define DMA_SNSEQCTLB_SNSDIST_15                       (0x00008000UL)
#define DMA_SNSEQCTLB_SNSDIST_16                       (0x00010000UL)
#define DMA_SNSEQCTLB_SNSDIST_17                       (0x00020000UL)
#define DMA_SNSEQCTLB_SNSDIST_18                       (0x00040000UL)
#define DMA_SNSEQCTLB_SNSDIST_19                       (0x00080000UL)
#define DMA_SNSEQCTLB_SNSCNTB_POS                      (20U)
#define DMA_SNSEQCTLB_SNSCNTB                          (0xFFF00000UL)
#define DMA_SNSEQCTLB_SNSCNTB_0                        (0x00100000UL)
#define DMA_SNSEQCTLB_SNSCNTB_1                        (0x00200000UL)
#define DMA_SNSEQCTLB_SNSCNTB_2                        (0x00400000UL)
#define DMA_SNSEQCTLB_SNSCNTB_3                        (0x00800000UL)
#define DMA_SNSEQCTLB_SNSCNTB_4                        (0x01000000UL)
#define DMA_SNSEQCTLB_SNSCNTB_5                        (0x02000000UL)
#define DMA_SNSEQCTLB_SNSCNTB_6                        (0x04000000UL)
#define DMA_SNSEQCTLB_SNSCNTB_7                        (0x08000000UL)
#define DMA_SNSEQCTLB_SNSCNTB_8                        (0x10000000UL)
#define DMA_SNSEQCTLB_SNSCNTB_9                        (0x20000000UL)
#define DMA_SNSEQCTLB_SNSCNTB_10                       (0x40000000UL)
#define DMA_SNSEQCTLB_SNSCNTB_11                       (0x80000000UL)

/*  Bit definition for DMA_DNSEQCTL register  */
#define DMA_DNSEQCTL_DOFFSET_POS                       (0U)
#define DMA_DNSEQCTL_DOFFSET                           (0x000FFFFFUL)
#define DMA_DNSEQCTL_DNSCNT_POS                        (20U)
#define DMA_DNSEQCTL_DNSCNT                            (0xFFF00000UL)

/*  Bit definition for DMA_DNSEQCTLB register  */
#define DMA_DNSEQCTLB_DNSDIST_POS                      (0U)
#define DMA_DNSEQCTLB_DNSDIST                          (0x000FFFFFUL)
#define DMA_DNSEQCTLB_DNSDIST_0                        (0x00000001UL)
#define DMA_DNSEQCTLB_DNSDIST_1                        (0x00000002UL)
#define DMA_DNSEQCTLB_DNSDIST_2                        (0x00000004UL)
#define DMA_DNSEQCTLB_DNSDIST_3                        (0x00000008UL)
#define DMA_DNSEQCTLB_DNSDIST_4                        (0x00000010UL)
#define DMA_DNSEQCTLB_DNSDIST_5                        (0x00000020UL)
#define DMA_DNSEQCTLB_DNSDIST_6                        (0x00000040UL)
#define DMA_DNSEQCTLB_DNSDIST_7                        (0x00000080UL)
#define DMA_DNSEQCTLB_DNSDIST_8                        (0x00000100UL)
#define DMA_DNSEQCTLB_DNSDIST_9                        (0x00000200UL)
#define DMA_DNSEQCTLB_DNSDIST_10                       (0x00000400UL)
#define DMA_DNSEQCTLB_DNSDIST_11                       (0x00000800UL)
#define DMA_DNSEQCTLB_DNSDIST_12                       (0x00001000UL)
#define DMA_DNSEQCTLB_DNSDIST_13                       (0x00002000UL)
#define DMA_DNSEQCTLB_DNSDIST_14                       (0x00004000UL)
#define DMA_DNSEQCTLB_DNSDIST_15                       (0x00008000UL)
#define DMA_DNSEQCTLB_DNSDIST_16                       (0x00010000UL)
#define DMA_DNSEQCTLB_DNSDIST_17                       (0x00020000UL)
#define DMA_DNSEQCTLB_DNSDIST_18                       (0x00040000UL)
#define DMA_DNSEQCTLB_DNSDIST_19                       (0x00080000UL)
#define DMA_DNSEQCTLB_DNSCNTB_POS                      (20U)
#define DMA_DNSEQCTLB_DNSCNTB                          (0xFFF00000UL)
#define DMA_DNSEQCTLB_DNSCNTB_0                        (0x00100000UL)
#define DMA_DNSEQCTLB_DNSCNTB_1                        (0x00200000UL)
#define DMA_DNSEQCTLB_DNSCNTB_2                        (0x00400000UL)
#define DMA_DNSEQCTLB_DNSCNTB_3                        (0x00800000UL)
#define DMA_DNSEQCTLB_DNSCNTB_4                        (0x01000000UL)
#define DMA_DNSEQCTLB_DNSCNTB_5                        (0x02000000UL)
#define DMA_DNSEQCTLB_DNSCNTB_6                        (0x04000000UL)
#define DMA_DNSEQCTLB_DNSCNTB_7                        (0x08000000UL)
#define DMA_DNSEQCTLB_DNSCNTB_8                        (0x10000000UL)
#define DMA_DNSEQCTLB_DNSCNTB_9                        (0x20000000UL)
#define DMA_DNSEQCTLB_DNSCNTB_10                       (0x40000000UL)
#define DMA_DNSEQCTLB_DNSCNTB_11                       (0x80000000UL)

/*  Bit definition for DMA_LLP register  */
#define DMA_LLP_LLP_POS                                (2U)
#define DMA_LLP_LLP                                    (0xFFFFFFFCUL)

/*  Bit definition for DMA_CHCTL register  */
#define DMA_CHCTL_SINC_POS                             (0U)
#define DMA_CHCTL_SINC                                 (0x00000003UL)
#define DMA_CHCTL_SINC_0                               (0x00000001UL)
#define DMA_CHCTL_SINC_1                               (0x00000002UL)
#define DMA_CHCTL_DINC_POS                             (2U)
#define DMA_CHCTL_DINC                                 (0x0000000CUL)
#define DMA_CHCTL_DINC_0                               (0x00000004UL)
#define DMA_CHCTL_DINC_1                               (0x00000008UL)
#define DMA_CHCTL_SRPTEN_POS                           (4U)
#define DMA_CHCTL_SRPTEN                               (0x00000010UL)
#define DMA_CHCTL_DRPTEN_POS                           (5U)
#define DMA_CHCTL_DRPTEN                               (0x00000020UL)
#define DMA_CHCTL_SNSEQEN_POS                          (6U)
#define DMA_CHCTL_SNSEQEN                              (0x00000040UL)
#define DMA_CHCTL_DNSEQEN_POS                          (7U)
#define DMA_CHCTL_DNSEQEN                              (0x00000080UL)
#define DMA_CHCTL_HSIZE_POS                            (8U)
#define DMA_CHCTL_HSIZE                                (0x00000300UL)
#define DMA_CHCTL_HSIZE_0                              (0x00000100UL)
#define DMA_CHCTL_HSIZE_1                              (0x00000200UL)
#define DMA_CHCTL_LLPEN_POS                            (10U)
#define DMA_CHCTL_LLPEN                                (0x00000400UL)
#define DMA_CHCTL_LLPRUN_POS                           (11U)
#define DMA_CHCTL_LLPRUN                               (0x00000800UL)
#define DMA_CHCTL_IE_POS                               (12U)
#define DMA_CHCTL_IE                                   (0x00001000UL)

/*  Bit definition for DMA_MONSAR register  */
#define DMA_MONSAR                                     (0xFFFFFFFFUL)

