MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F451KETB/mcu.h
/*******************************************************************************
                Bit definition for Peripheral KEYSCAN
*******************************************************************************/
/*  Bit definition for KEYSCAN_SCR register  */
#define KEYSCAN_SCR_KEYINSEL_POS                       (0U)
#define KEYSCAN_SCR_KEYINSEL                           (0x0000FFFFUL)
#define KEYSCAN_SCR_KEYOUTSEL_POS                      (16U)
#define KEYSCAN_SCR_KEYOUTSEL                          (0x00070000UL)
#define KEYSCAN_SCR_CKSEL_POS                          (20U)
#define KEYSCAN_SCR_CKSEL                              (0x00300000UL)
#define KEYSCAN_SCR_CKSEL_0                            (0x00100000UL)
#define KEYSCAN_SCR_CKSEL_1                            (0x00200000UL)
#define KEYSCAN_SCR_T_LLEVEL_POS                       (24U)
#define KEYSCAN_SCR_T_LLEVEL                           (0x1F000000UL)
#define KEYSCAN_SCR_T_HIZ_POS                          (29U)
#define KEYSCAN_SCR_T_HIZ                              (0xE0000000UL)

/*  Bit definition for KEYSCAN_SER register  */
#define KEYSCAN_SER_SEN                                (0x00000001UL)

/*  Bit definition for KEYSCAN_SSR register  */
#define KEYSCAN_SSR_INDEX                              (0x00000007UL)

/*******************************************************************************
                Bit definition for Peripheral MPU
*******************************************************************************/
/*  Bit definition for MPU_RGD register  */
#define MPU_RGD_MPURGSIZE_POS                          (0U)
#define MPU_RGD_MPURGSIZE                              (0x0000001FUL)
#define MPU_RGD_MPURGADDR_POS                          (5U)
#define MPU_RGD_MPURGADDR                              (0xFFFFFFE0UL)

/*  Bit definition for MPU_RGCR register  */
#define MPU_RGCR_S2RGRP_POS                            (0U)
#define MPU_RGCR_S2RGRP                                (0x00000001UL)
#define MPU_RGCR_S2RGWP_POS                            (1U)
#define MPU_RGCR_S2RGWP                                (0x00000002UL)
#define MPU_RGCR_S2RGE_POS                             (7U)
#define MPU_RGCR_S2RGE                                 (0x00000080UL)
#define MPU_RGCR_S1RGRP_POS                            (8U)
#define MPU_RGCR_S1RGRP                                (0x00000100UL)
#define MPU_RGCR_S1RGWP_POS                            (9U)
#define MPU_RGCR_S1RGWP                                (0x00000200UL)
#define MPU_RGCR_S1RGE_POS                             (15U)
#define MPU_RGCR_S1RGE                                 (0x00008000UL)
#define MPU_RGCR_FRGRP_POS                             (16U)
#define MPU_RGCR_FRGRP                                 (0x00010000UL)
#define MPU_RGCR_FRGWP_POS                             (17U)
#define MPU_RGCR_FRGWP                                 (0x00020000UL)
#define MPU_RGCR_FRGE_POS                              (23U)
#define MPU_RGCR_FRGE                                  (0x00800000UL)

/*  Bit definition for MPU_CR register  */
#define MPU_CR_SMPU2BRP_POS                            (0U)
#define MPU_CR_SMPU2BRP                                (0x00000001UL)
#define MPU_CR_SMPU2BWP_POS                            (1U)
#define MPU_CR_SMPU2BWP                                (0x00000002UL)
#define MPU_CR_SMPU2ACT_POS                            (2U)
#define MPU_CR_SMPU2ACT                                (0x0000000CUL)
#define MPU_CR_SMPU2ACT_0                              (0x00000004UL)
#define MPU_CR_SMPU2ACT_1                              (0x00000008UL)
#define MPU_CR_SMPU2E_POS                              (7U)
#define MPU_CR_SMPU2E                                  (0x00000080UL)
#define MPU_CR_SMPU1BRP_POS                            (8U)
#define MPU_CR_SMPU1BRP                                (0x00000100UL)
#define MPU_CR_SMPU1BWP_POS                            (9U)
#define MPU_CR_SMPU1BWP                                (0x00000200UL)
#define MPU_CR_SMPU1ACT_POS                            (10U)
#define MPU_CR_SMPU1ACT                                (0x00000C00UL)
#define MPU_CR_SMPU1ACT_0                              (0x00000400UL)
#define MPU_CR_SMPU1ACT_1                              (0x00000800UL)
#define MPU_CR_SMPU1E_POS                              (15U)
#define MPU_CR_SMPU1E                                  (0x00008000UL)
#define MPU_CR_FMPUBRP_POS                             (16U)
#define MPU_CR_FMPUBRP                                 (0x00010000UL)
#define MPU_CR_FMPUBWP_POS                             (17U)
#define MPU_CR_FMPUBWP                                 (0x00020000UL)
#define MPU_CR_FMPUACT_POS                             (18U)
#define MPU_CR_FMPUACT                                 (0x000C0000UL)
#define MPU_CR_FMPUACT_0                               (0x00040000UL)
#define MPU_CR_FMPUACT_1                               (0x00080000UL)
#define MPU_CR_FMPUE_POS                               (23U)
#define MPU_CR_FMPUE                                   (0x00800000UL)

/*  Bit definition for MPU_SR register  */
#define MPU_SR_SMPU2EAF_POS                            (0U)
#define MPU_SR_SMPU2EAF                                (0x00000001UL)
#define MPU_SR_SMPU1EAF_POS                            (8U)
#define MPU_SR_SMPU1EAF                                (0x00000100UL)
#define MPU_SR_FMPUEAF_POS                             (16U)
#define MPU_SR_FMPUEAF                                 (0x00010000UL)

/*  Bit definition for MPU_ECLR register  */
#define MPU_ECLR_SMPU2ECLR_POS                         (0U)
#define MPU_ECLR_SMPU2ECLR                             (0x00000001UL)
#define MPU_ECLR_SMPU1ECLR_POS                         (8U)
#define MPU_ECLR_SMPU1ECLR                             (0x00000100UL)
#define MPU_ECLR_FMPUECLR_POS                          (16U)
#define MPU_ECLR_FMPUECLR                              (0x00010000UL)

/*  Bit definition for MPU_WP register  */
#define MPU_WP_MPUWE_POS                               (0U)
#define MPU_WP_MPUWE                                   (0x00000001UL)
#define MPU_WP_WKEY_POS                                (1U)
#define MPU_WP_WKEY                                    (0x0000FFFEUL)

/*  Bit definition for MPU_IPPR register  */
#define MPU_IPPR_AESRDP_POS                            (0U)
#define MPU_IPPR_AESRDP                                (0x00000001UL)
#define MPU_IPPR_AESWRP_POS                            (1U)
#define MPU_IPPR_AESWRP                                (0x00000002UL)
#define MPU_IPPR_HASHRDP_POS                           (2U)
#define MPU_IPPR_HASHRDP                               (0x00000004UL)
#define MPU_IPPR_HASHWRP_POS                           (3U)
#define MPU_IPPR_HASHWRP                               (0x00000008UL)
#define MPU_IPPR_TRNGRDP_POS                           (4U)
#define MPU_IPPR_TRNGRDP                               (0x00000010UL)
#define MPU_IPPR_TRNGWRP_POS                           (5U)
#define MPU_IPPR_TRNGWRP                               (0x00000020UL)
#define MPU_IPPR_CRCRDP_POS                            (6U)
#define MPU_IPPR_CRCRDP                                (0x00000040UL)
#define MPU_IPPR_CRCWRP_POS                            (7U)
#define MPU_IPPR_CRCWRP                                (0x00000080UL)
#define MPU_IPPR_EFMRDP_POS                            (8U)
#define MPU_IPPR_EFMRDP                                (0x00000100UL)
#define MPU_IPPR_EFMWRP_POS                            (9U)
#define MPU_IPPR_EFMWRP                                (0x00000200UL)
#define MPU_IPPR_WDTRDP_POS                            (12U)
#define MPU_IPPR_WDTRDP                                (0x00001000UL)
#define MPU_IPPR_WDTWRP_POS                            (13U)
#define MPU_IPPR_WDTWRP                                (0x00002000UL)
#define MPU_IPPR_SWDTRDP_POS                           (14U)
#define MPU_IPPR_SWDTRDP                               (0x00004000UL)
#define MPU_IPPR_SWDTWRP_POS                           (15U)
#define MPU_IPPR_SWDTWRP                               (0x00008000UL)
#define MPU_IPPR_BKSRAMRDP_POS                         (16U)
#define MPU_IPPR_BKSRAMRDP                             (0x00010000UL)
#define MPU_IPPR_BKSRAMWRP_POS                         (17U)
#define MPU_IPPR_BKSRAMWRP                             (0x00020000UL)
#define MPU_IPPR_RTCRDP_POS                            (18U)
#define MPU_IPPR_RTCRDP                                (0x00040000UL)
#define MPU_IPPR_RTCWRP_POS                            (19U)
#define MPU_IPPR_RTCWRP                                (0x00080000UL)
#define MPU_IPPR_DMPURDP_POS                           (20U)
#define MPU_IPPR_DMPURDP                               (0x00100000UL)
#define MPU_IPPR_DMPUWRP_POS                           (21U)
#define MPU_IPPR_DMPUWRP                               (0x00200000UL)
#define MPU_IPPR_SRAMCRDP_POS                          (22U)
#define MPU_IPPR_SRAMCRDP                              (0x00400000UL)
#define MPU_IPPR_SRAMCWRP_POS                          (23U)
#define MPU_IPPR_SRAMCWRP                              (0x00800000UL)
#define MPU_IPPR_INTCRDP_POS                           (24U)
#define MPU_IPPR_INTCRDP                               (0x01000000UL)
#define MPU_IPPR_INTCWRP_POS                           (25U)
#define MPU_IPPR_INTCWRP                               (0x02000000UL)
#define MPU_IPPR_SYSCRDP_POS                           (26U)
#define MPU_IPPR_SYSCRDP                               (0x04000000UL)
#define MPU_IPPR_SYSCWRP_POS                           (27U)
#define MPU_IPPR_SYSCWRP                               (0x08000000UL)
#define MPU_IPPR_MSTPRDP_POS                           (28U)
#define MPU_IPPR_MSTPRDP                               (0x10000000UL)
#define MPU_IPPR_MSTPWRP_POS                           (29U)
#define MPU_IPPR_MSTPWRP                               (0x20000000UL)
#define MPU_IPPR_BUSERRE_POS                           (31U)
#define MPU_IPPR_BUSERRE                               (0x80000000UL)

